Tekla Open API Reference for Tekla Structures 2025
RebarGeometry.Shape Property
The physical points of the reinforcing bar.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PolyLine Shape { get; }
Public ReadOnly Property Shape As PolyLine
	Get
Property Value
Type: PolyLine
See Also
Reference
RebarGeometry Class
Tekla.Structures.Model Namespace